---
kind: other
id: Methods.T:Autodesk.Revit.DB.TriOrQuadFacet
source: html/90b08832-7d17-6f1a-ef4e-18d56c895675.htm
---
# TriOrQuadFacet Methods

Returns the index of the specified vertex of this facet (as an index into the external array
 of vertices in the TriangulationInterface that was used to create the list of TriOrQuadFacets).